# 작업 1유형

In [9]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
df

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12865,14023,47,technician,married,secondary,no,1167,yes,no,cellular,30,apr,1,87,5,failure,yes
12866,17259,31,unknown,married,secondary,no,111,no,no,cellular,21,nov,2,93,2,failure,yes
12867,15200,37,unemployed,single,tertiary,no,1316,yes,no,cellular,18,nov,1,172,2,failure,no
12868,13775,42,management,married,tertiary,no,479,yes,no,unknown,28,may,2,-1,0,unknown,no
12869,20137,24,services,single,secondary,no,0,no,no,unknown,16,may,1,-1,0,unknown,no

### 1. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? (0~9 : 0 , 10~19 : 10)

In [16]:
df['나이대'] = df['age'] // 10 * 10
ans = df['나이대'].value_counts().index[0]
print(ans)

30

### 2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [18]:
ans = df['나이대'].value_counts().values[0]
print(ans)

5056

### 3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [21]:
tmp = df[(df['age'] >= 25) & (df['age'] < 29)]
ans = len(tmp[tmp['housing'] == "yes"])
print(ans)

504

### 4. numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [76]:
ans = df.select_dtypes(object).nunique().sort_values(ascending = False).index[0]
print(ans)

job

### 5. balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [84]:
df[df['balance'] >=df['balance'].mean()].sort_values('ID').head(100).balance.mean()

5777.54

### 6. 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

In [91]:
df[['day', 'month']].value_counts().index[0]

(15, 'may')

### 7. 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

In [98]:
from scipy.stats import shapiro

tmp = df[df['job'] == 'unknown'].age
shapiro(tmp).pvalue

0.1961131989955902

### 8. age와 balance의 피어슨 상관계수를 구하여라

In [112]:
a = df[['age','balance']].corr()
a.iloc[0,1]

0.10198734763981462

### 9. y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

In [119]:
from scipy.stats import chi2_contingency
chi2_contingency(v)

(133.87601246919445,
 7.901201277473551e-29,
 3,
 array([[1300.51592852, 4405.15182595, 2818.93745144,  378.39479409],
        [ 579.48407148, 1962.84817405, 1256.06254856,  168.60520591]]))

In [118]:
v = pd.crosstab(df.y, df.education)
v

education  primary  secondary  tertiary  unknown
y
no            1424       4555      2559      365
yes            456       1813      1516      182

### 10. 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [262]:
t = df.groupby(['job','marital']).size().reset_index()
t
pivotdf = t.pivot_table(index='job',columns='marital')
pivotdf = pivotdf.fillna(0)
pivotdf[0, 'ratio'] = pivotdf[0, 'divorced'] / pivotdf[0, 'married']
pivotdf = pivotdf.reset_index(drop=True)
pivotdf[0, 'ratio'].sort_values().values[-1]

0.2831050228310502